package org.aladdin.roadsconditions

import org.apache.spark.sql.types.{BooleanType, StringType, StructField, StructType, TimestampType}

object Models {
  val roadMessageSchema: StructType = StructType(List(
    StructField("messageId", StringType),
    StructField("group", StringType),
    StructField("sentTime", TimestampType),
    StructField("text", StringType),
    StructField("isAdmin", BooleanType),
    StructField("isReply", BooleanType)
  ))

  val roadMessageStructuredSchema: StructType = StructType(List(
    StructField("group", StringType),
    StructField("sentTime", TimestampType),
    StructField("isAdmin", BooleanType),
    StructField("checkpoint", StringType),
    StructField("city", StringType),
    StructField("status", StringType),
    StructField("direction", StringType),
  ))

  val Checkpoints: Map[String, List[String]] = Map(
    // نابلس
    "حاجز حوارة" -> List("حاجز حواره", "حاجز حواره", "حواره الحاجز" ,"حوارة الحاجز"),
    "عورتا" -> List("عورتا", "عورتى", "عورته","عروتا"),
    "المربعة" -> List( "مربعة" ,"مربعه"),
    "دير شرف" -> List("ديرشرف", "دير شرف"),
    "صرة"-> List("صرة", "صره"),
    "17 عصيرة"-> List("١٧", "17", "سبعتاش"),
    "جيت" -> List("جيت"),
    "طنيب" -> List("طنيب"),
    "شافي شمرون" -> List("شافي", "شمرون"),
    "الغرس بزاريا" -> List("غرس"),
    "بزاريا" -> List("بزاريا"),
    "بيت فوريك" -> List("فوريك"),
    "الباذان" -> List("باذان"),
    "بوابة جماعين" -> List("جماعين"),
    "بوابة عقربا" -> List("عقربا"),
    "بوابة بورين" -> List("بوابه بورين","بورين"),
    "بوابة عقربا" -> List("عقربا"),
    "الحمرا" -> List("حمرا" ,"الحمرا"),
    "زعترة" -> List("زعترة","زعتره"),

    // رام الله
    "DCO" -> List("DCO", "dco", "دي سي او"),
    "جلزون" -> List("جلزون"),
    "مخماس" -> List("مخماس"),
    "عين سينيا" -> List("عين سينيا"),
    "عيون الحرامية" -> List("عيون حرامية", "عيون حراميه", "عيون الحرامية", "عيون الحراميه"),
    "عطارة"-> List("عطاره", "عطارة"),
    "روابي"-> List("روابي"),
    "دير بلوط"-> List("دير البلوط","دير بلوط"),
    "ترمسعيا"-> List("ترمسعيا"),
    "سنجل"-> List("سنجل البوابات","بوابة سنجل","سنجل البوابة","بوابه سنجل"),
    "عيلي"-> List("عيلي"),
    "عوفرا"-> List("عوفرا", "عوفره"),
    "كرملو"-> List("كرملو"),
    "بوابة عابود"-> List("بوابه عابود","بوابة عابود"),
    "بوابة دير ابو مشعل"-> List("ابو مشعل"),
    "بوابة النبي صالح"-> List("النبي صالح"),
    "بيت ايل"-> List("بيت ايل"),
    "جسر اودلا"-> List("اودلا"),

    // سلفيت
    "بوابة بروقين"-> List("بروقين"),
    "بوابة سلفيت"-> List("بوابة سلفيت","بوابه سلفيت"),
    "بوابة بروقين"-> List("بروقين"),
    "سد قراوة"-> List("قراوة","قراوه"),
    "ارائيل" -> List("ارائيل"),
    "حارس" -> List("حارس"),
    "كدوميم" -> List("كدوميم"),
    "واد قانا" -> List("واد قانا", "وادقانا"),
    "بوابة كفر الديك" -> List("كفر الديك"),
    "ياسوف" -> List("ياسوف"),

    // قلقيلية
    "الفندق" -> List("الفندق"),
    "عزبة الطبيب" -> List("عزبه الطبيب","عزبة الطبيب"),
    "كرني شمرون" -> List("كرني شمرون"),
    "النبي الياس" -> List("نبي الياس", "نبي لياس"),
    "نفق حبلة" -> List("حبلة","حبله"),
    "كفر لاقف" -> List("كفر لاقف"),
    "اسفل جسر عزون" -> List("جسر عزون"),
    "عزون" -> List("عزون"),

    // طولكرم
    "عناب" -> List("عناب"),
    "طريق الكفريات" -> List("كفريات"),
    "جبارة" -> List("جباره", "جبارة"),
    "بيت ليد المصانع" -> List("بيت ليد المصانع"),
    "بيت ليد" -> List("بيت ليد"),
    "حجة واد قانا" -> List("حجة واد قانا", "حجه واد قانا"),
    "رامين" -> List("رامين"),
    "سفارين" -> List("سفارين"),
    "عزبة شوفة" -> List("عزبه شوفه", "عزبه شوفة","عزبة شوفه","عزبة شوفة"),
    "سفارين" -> List("سفارين"),

    // جنين
    "حومش" -> List("حومش"),
    "جبع" -> List("جبع"),
    "السيلة" -> List("سيلة","سيله"),
    "دوتان" -> List("دوتان"),
    "حرميش" -> List("حرميش"),

    // طوباس
    "تياسير" -> List("تياسير"),

    // اريحا
    "معالي افرايم" -> List("فرايم", "افرايم"),
    "تياسير" -> List("تياسير"),
    "المعرجات" -> List("معرجات"),
    "الهيئة" -> List("هيئه","هيئة"),
    "البنانا" -> List("بنانا"),

    // بيت لحم
    "الكونتينر" -> List("كونتينر"),

    // الخليل
    "فرش الهوى"-> List("فرش الهوى","فرشالهوا","فرش الهوا"),
    "حاجز الفحص" -> List("الفحص"),
  )

  val cityCheckpointMapping: Map[String, List[String]] = Map(
    // نابلس
    "نابلس" -> List(
      "حاجز حوارة",
      "عورتا",
      "المربعة",
      "دير شرف",
      "صرة",
      "17 عصيرة",
      "جيت",
      "طنيب",
      "شافي شمرون",
      "الغرس بزاريا",
      "بزاريا",
      "بيت فوريك",
      "الباذان",
      "بوابة جماعين",
      "بوابة عقربا",
      "بوابة بورين",
      "الحمرا",
      "زعترة"
    ),

    // رام الله
    "رام الله" -> List(
      "DCO",
      "جلزون",
      "مخماس",
      "عين سينيا",
      "عيون الحرامية",
      "عطارة",
      "روابي",
      "دير بلوط",
      "ترمسعيا",
      "سنجل",
      "عيلي",
      "عوفرا",
      "كرملو",
      "بوابة عابود",
      "بوابة دير ابو مشعل",
      "بوابة النبي صالح",
      "بيت ايل",
      "جسر اودلا"
    ),

    // سلفيت
    "سلفيت" -> List(
      "بوابة بروقين",
      "بوابة سلفيت",
      "سد قراوة",
      "ارائيل",
      "حارس",
      "كدوميم",
      "واد قانا",
      "بوابة كفر الديك",
      "ياسوف"
    ),

    // قلقيلية
    "قلقيلية" -> List(
      "الفندق",
      "عزبة الطبيب",
      "كرني شمرون",
      "النبي الياس",
      "نفق حبلة",
      "كفر لاقف",
      "اسفل جسر عزون",
      "عزون"
    ),

    // طولكرم
    "طولكرم" -> List(
      "عناب",
      "طريق الكفريات",
      "جبارة",
      "بيت ليد المصانع",
      "بيت ليد",
      "حجة واد قانا",
      "رامين",
      "سفارين",
      "عزبة شوفة"
    ),

    // جنين
    "جنين" -> List(
      "حومش",
      "جبع",
      "السيلة",
      "دوتان",
      "حرميش"
    ),

    // طوباس
    "طوباس" -> List(
      "تياسير"
    ),

    // اريحا
    "اريحا" -> List(
      "معالي افرايم",
      "تياسير",
      "المعرجات",
      "الهيئة",
      "البنانا"
    ),

    // بيت لحم
    "بيت لحم"-> List(
      "الكونتينر"
    ),

    // الخليل
    "الخليل"-> List(
      "فرش الهوى",
      "حاجز الفحص"
    ),

  )

  val CheckpointState: Map[String, List[String]] = Map(
    "مفتوح" -> List("سالك", "بحري", "مفتوح" ,"فاتح"),
    "مغلق" -> List("مسكر" ,"مغلق"),
    "ازمة" -> List("أزمة","أزمه", "ازمة","ازمه" ,"كثافة", "كثافه", "خانفة", "خانقه","وقوف","سيارة سيارة"),
    "حاجز"-> List("حاجز"))

  val CheckpointDirection: Map[String, List[String]] = Map(
    "داخل" -> List("داخل"),
    "خارج" -> List("طالع","خارج"),
    "الاتجاهين" -> List("الاتجاهين"))

  val groups: List[String] = List("ahwalaltreq", "ahwalaltareq", "a7walstreet", "road_jehad")
}
