var cityCheckpointMapping = {
    // نابلس
    "نابلس": [
      "حاجز حوارة",
      "عورتا",
      "المربعة",
      "دير شرف",
      "صرة",
      "17 عصيرة",
      "جيت",
      "طنيب",
      "شافي شمرون",
      "الغرس بزاريا",
      "بزاريا",
      "بيت فوريك",
      "الباذان",
      "بوابة جماعين",
      "بوابة عقربا",
      "بوابة بورين",
      "الحمرا",
      "زعترة"
    ],

    // رام الله
    "رام الله": [
      "DCO",
      "جلزون",
      "مخماس",
      "عين سينيا",
      "عيون الحرامية",
      "عطارة",
      "روابي",
      "دير بلوط",
      "ترمسعيا",
      "سنجل",
      "عيلي",
      "عوفرا",
      "كرملو",
      "بوابة عابود",
      "بوابة دير ابو مشعل",
      "بوابة النبي صالح",
      "بيت ايل",
      "جسر اودلا"
    ],

    // سلفيت
    "سلفيت": [
      "بوابة بروقين",
      "بوابة سلفيت",
      "سد قراوة",
      "ارائيل",
      "حارس",
      "كدوميم",
      "واد قانا",
      "بوابة كفر الديك",
      "ياسوف"
    ],

    // قلقيلية
    "قلقيلية": [
      "الفندق",
      "عزبة الطبيب",
      "كرني شمرون",
      "النبي الياس",
      "نفق حبلة",
      "كفر لاقف",
      "اسفل جسر عزون",
      "عزون"
    ],

    // طولكرم
    "طولكرم": [
      "عناب",
      "طريق الكفريات",
      "جبارة",
      "بيت ليد المصانع",
      "بيت ليد",
      "حجة واد قانا",
      "رامين",
      "سفارين",
      "عزبة شوفة"
    ],

    // جنين
    "جنين": [
      "حومش",
      "جبع",
      "السيلة",
      "دوتان",
      "حرميش"
    ],

    // طوباس
    "طوباس": [
      "تياسير"
    ],

    // اريحا
    "اريحا": [
      "معالي افرايم",
      "تياسير",
      "المعرجات",
      "الهيئة",
      "البنانا"
    ],

    // بيت لحم
    "بيت لحم": [
      "الكونتينر"
    ],

    // الخليل
    "الخليل": [
      "فرش الهوى",
      "حاجز الفحص"
    ]
}

var checkpointAliases = {
    // نابلس
    "حاجز حوارة": ["حاجز حواره", "حاجز حواره", "حواره الحاجز" ,"حوارة الحاجز"],
    "عورتا": ["عورتا", "عورتى", "عورته","عروتا"],
    "المربعة": [ "مربعة" ,"مربعه"],
    "دير شرف": ["ديرشرف", "دير شرف"],
    "صرة": ["صرة", "صره"],
    "17 عصيرة": ["١٧", "17", "سبعتاش"],
    "جيت": ["جيت"],
    "طنيب": ["طنيب"],
    "شافي شمرون": ["شافي", "شمرون"],
    "الغرس بزاريا": ["غرس"],
    "بزاريا": ["بزاريا"],
    "بيت فوريك": ["فوريك"],
    "الباذان": ["باذان"],
    "بوابة جماعين": ["جماعين"],
    "بوابة عقربا": ["عقربا"],
    "بوابة بورين": ["بوابه بورين","بورين"],
    "بوابة عقربا": ["عقربا"],
    "الحمرا": ["حمرا" ,"الحمرا"],
    "زعترة": ["زعترة","زعتره"],

    // رام الله
    "DCO": ["DCO", "dco", "دي سي او"],
    "جلزون": ["جلزون"],
    "مخماس": ["مخماس"],
    "عين سينيا": ["عين سينيا"],
    "عيون الحرامية": ["عيون حرامية", "عيون حراميه", "عيون الحرامية", "عيون الحراميه"],
    "عطارة": ["عطاره", "عطارة"],
    "روابي": ["روابي"],
    "دير بلوط": ["دير البلوط","دير بلوط"],
    "ترمسعيا": ["ترمسعيا"],
    "سنجل": ["سنجل البوابات","بوابة سنجل","سنجل البوابة","بوابه سنجل"],
    "عيلي": ["عيلي"],
    "عوفرا": ["عوفرا", "عوفره"],
    "كرملو": ["كرملو"],
    "بوابة عابود": ["بوابه عابود","بوابة عابود"],
    "بوابة دير ابو مشعل": ["ابو مشعل"],
    "بوابة النبي صالح": ["النبي صالح"],
    "بيت ايل": ["بيت ايل"],
    "جسر اودلا": ["اودلا"],

    // سلفيت
    "بوابة بروقين": ["بروقين"],
    "بوابة سلفيت": ["بوابة سلفيت","بوابه سلفيت"],
    "بوابة بروقين": ["بروقين"],
    "سد قراوة": ["قراوة","قراوه"],
    "ارائيل": ["ارائيل"],
    "حارس": ["حارس"],
    "كدوميم": ["كدوميم"],
    "واد قانا": ["واد قانا", "وادقانا"],
    "بوابة كفر الديك": ["كفر الديك"],
    "ياسوف": ["ياسوف"],

    // قلقيلية
    "الفندق": ["الفندق"],
    "عزبة الطبيب": ["عزبه الطبيب","عزبة الطبيب"],
    "كرني شمرون": ["كرني شمرون"],
    "النبي الياس": ["نبي الياس", "نبي لياس"],
    "نفق حبلة": ["حبلة","حبله"],
    "كفر لاقف": ["كفر لاقف"],
    "اسفل جسر عزون": ["جسر عزون"],
    "عزون": ["عزون"],

    // طولكرم
    "عناب": ["عناب"],
    "طريق الكفريات": ["كفريات"],
    "جبارة": ["جباره", "جبارة"],
    "بيت ليد المصانع": ["بيت ليد المصانع"],
    "بيت ليد": ["بيت ليد"],
    "حجة واد قانا": ["حجة واد قانا", "حجه واد قانا"],
    "رامين": ["رامين"],
    "سفارين": ["سفارين"],
    "عزبة شوفة": ["عزبه شوفه", "عزبه شوفة","عزبة شوفه","عزبة شوفة"],
    "سفارين": ["سفارين"],

    // جنين
    "حومش": ["حومش"],
    "جبع": ["جبع"],
    "السيلة": ["سيلة","سيله"],
    "دوتان": ["دوتان"],
    "حرميش": ["حرميش"],

    // طوباس
    "تياسير": ["تياسير"],

    // اريحا
    "معالي افرايم": ["فرايم", "افرايم"],
    "تياسير": ["تياسير"],
    "المعرجات": ["معرجات"],
    "الهيئة": ["هيئه","هيئة"],
    "البنانا": ["بنانا"],

    // بيت لحم
    "الكونتينر": ["كونتينر"],

    // الخليل
    "فرش الهوى": ["فرش الهوى","فرشالهوا","فرش الهوا"],
    "حاجز الفحص": ["الفحص"],
}


function getCheckpoint(inputString, isReply, city) {
    if (!cityCheckpointMapping[city] || (!isReply && isQuestion(inputString))) {
        return null;
    }

    const checkpoints = cityCheckpointMapping[city];

    // TODO: Iterate over each checkpoint
    for (const checkpoint of checkpoints) {
        // TODO: Check if the input matches the checkpoint name or its aliases
        if (
            inputString.includes(checkpoint) ||
            (checkpointAliases[checkpoint] && checkpointAliases[checkpoint].some(alias => inputString.includes(alias)))
        ) {
            return checkpoint;
        }
    }

    // TODO: If no checkpoint matches, return null
    return null;
}

function isQuestion(inputString) {
  return ["كيف","شو", "?", "؟","اجي عليها","هل","وضع"].some(substring => inputString.includes(substring));
}

// TODO: Export the function for use in other files
export { getCheckpoint }
